Австралия/src/Documents/Quote/Quote.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Quote</name>
  <basedOn>Document.Event</basedOn>
  <basedOn>Catalog.Counterparties</basedOn>
  <registerRecords>AccumulationRegister.Quotations</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Multiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AmountIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCash</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Event</name>
    <type>
      <types>DocumentRef.Event</types>
    </type>
  </attributes>
  <attributes>
    <name>SetPaymentTerms</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountPercentByDiscountCard</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountCard</name>
    <type>
      <types>CatalogRef.DiscountCards</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountsAreCalculated</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidUntil</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TermsAndConditions</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>VariantsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreferredVariant</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalesRep</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrencyExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrencyMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObsoleteStatus</name>
    <type>
      <types>CatalogRef.QuotationStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentSubtotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentTax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AutomaticVATCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTaxRate</name>
    <type>
      <types>CatalogRef.SalesTaxRates</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalesTaxPercentage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Precision</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountMarkupPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AutomaticDiscountAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AutomaticDiscountsPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Variant</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BundleProduct</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>BundleCharacteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>CostShare</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentCalendar</name>
    <attributes>
      <name>PaymentBaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentTerm</name>
      <type>
        <types>EnumRef.PaymentTerm</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentDuePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentVATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DiscountsMarkups</name>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DiscountMarkup</name>
      <type>
        <types>CatalogRef.AutomaticDiscountTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddedBundles</name>
    <attributes>
      <name>BundleProduct</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>BundleCharacteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Variant</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SalesTax</name>
    <attributes>
      <name>Variant</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxRate</name>
      <type>
        <types>CatalogRef.SalesTaxRates</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/InformationRegisters/QuotationKanbanStatuses/QuotationKanbanStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>QuotationKanbanStatuses</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Status</name>
    <type>
      <types>CatalogRef.QuotationStatuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Quotation</name>
    <type>
      <types>DocumentRef.Quote</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ExchangeRateMethods/ExchangeRateMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeRateMethods</name>
  <enumValues>
    <name>Multiplier</name>
  </enumValues>
  <enumValues>
    <name>Divisor</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/QuotationStatuses/QuotationStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>QuotationStatuses</name>
  <predefined>
    <items>
      <name>Closed</name>
      <description>Closed</description>
    </items>
    <items>
      <name>Converted</name>
      <description>Converted</description>
    </items>
  </predefined>
  <attributes>
    <name>HighlightColor</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Order</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Disabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Documents/Quote/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region LibrariesHandlers

// Generate printed forms of objects
//
// Incoming:
//   TemplateNames    - String    - Names of layouts separated
//   by commas ObjectsArray  - Array    - Array of refs to objects that
//   need to be printed PrintParameters - Structure - Structure of additional printing parameters
//
// Outgoing:
//   PrintFormsCollection - Values table - Generated
//   table documents OutputParameters       - Structure        - Parameters of generated table documents
//
Procedure Print(ObjectsArray, PrintParameters, PrintFormsCollection, PrintObjects, OutputParameters) Export
	
	FillInParametersOfElectronicMail = True;
	
	If PrintManagement.TemplatePrintRequired(PrintFormsCollection, "Quote") Then
		PrintManagement.OutputSpreadsheetDocumentToCollection(
            PrintFormsCollection, 
            "Quote", 
            NStr("en = 'Quote'; ru = 'Коммерческое предложение';pl = 'Oferta cenowa';es_ES = 'Presupuesto';es_CO = 'Presupuesto';tr = 'Teklif';it = 'Preventivo';de = 'Angebot'"), 
            DataProcessors.PrintQuote.PrintQuote(ObjectsArray, PrintObjects, "Quote", PrintParameters.Result));
	EndIf;
	
	If PrintManagement.TemplatePrintRequired(PrintFormsCollection, "QuoteAllVariants") Then
		PrintManagement.OutputSpreadsheetDocumentToCollection(
            PrintFormsCollection, 
            "QuoteAllVariants", 
            NStr("en = 'Quotation (all variants)'; ru = 'Коммерческое предложение (все варианты)';pl = 'Oferta cenowa (wszystkie warianty)';es_ES = 'Presupuesto (todas las variantes)';es_CO = 'Presupuesto (todas las variantes)';tr = 'Teklif (tüm varyantlar)';it = 'Preventivo (tutte le varianti)';de = 'Angebot (alle Varianten)'"), 
            DataProcessors.PrintQuote.PrintQuote(ObjectsArray, PrintObjects, "QuoteAllVariants", PrintParameters.Result));
	EndIf;
	
	If PrintManagement.TemplatePrintRequired(PrintFormsCollection, "ProformaInvoice") Then
		PrintManagement.OutputSpreadsheetDocumentToCollection(
            PrintFormsCollection, 
            "ProformaInvoice", 
            NStr("en = 'Proforma invoice'; ru = 'Проформа-инвойс';pl = 'Faktura proforma';es_ES = 'Factura proforma';es_CO = 'Factura proforma';tr = 'Proforma fatura';it = 'Fattura proforma';de = 'Proforma-Rechnung'"), 
            DataProcessors.PrintQuote.PrintProformaInvoice(ObjectsArray, PrintObjects, "ProformaInvoice", PrintParameters.Result));
	EndIf;
	
	If PrintManagement.TemplatePrintRequired(PrintFormsCollection, "ProformaInvoiceAllVariants") Then
		PrintManagement.OutputSpreadsheetDocumentToCollection(
            PrintFormsCollection,
            "ProformaInvoiceAllVariants", 
            NStr("en = 'Proforma invoice (all variants)'; ru = 'Проформа-инвойс (все варианты)';pl = 'Faktura proforma (wszystkie warianty)';es_ES = 'Factura proforma (todas las variantes)';es_CO = 'Factura proforma (todas las variantes)';tr = 'Proforma fatura (tüm varyantlar)';it = 'Fattura proforma (tutte le varianti)';de = 'Proforma-Rechnung (alle Varianten)'"), 
            DataProcessors.PrintQuote.PrintProformaInvoice(ObjectsArray, PrintObjects, "ProformaInvoiceAllVariants", PrintParameters.Result));
	EndIf;
	
	// parameters of sending printing forms by email
	If FillInParametersOfElectronicMail Then
		DriveServer.FillSendingParameters(OutputParameters.SendOptions, ObjectsArray, PrintFormsCollection);
	EndIf;
	
EndProcedure

// Fills in Sales order printing commands list
// 
// Parameters:
//   PrintCommands - ValueTable - see fields' content in the PrintManagement.CreatePrintCommandsCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
	
	PrintCommand = PrintCommands.Add();
	PrintCommand.ID							= "Quote";
	PrintCommand.Presentation				= NStr("en = 'Quotation'; ru = 'Коммерческое предложение';pl = 'Oferta cenowa';es_ES = 'Presupuesto';es_CO = 'Presupuesto';tr = 'Teklif';it = 'Preventivo';de = 'Angebot'");
	PrintCommand.FormsList					= "DocumentForm,ListForm,DocumentsListForm";
	PrintCommand.CheckPostingBeforePrint	= True;
	PrintCommand.Order						= 1;
	
	PrintCommand = PrintCommands.Add();
	PrintCommand.ID							= "QuoteAllVariants";
	PrintCommand.Presentation				= NStr("en = 'Quotation (all variants)'; ru = 'Коммерческое предложение (все варианты)';pl = 'Oferta cenowa (wszystkie warianty)';es_ES = 'Presupuesto (todas las variantes)';es_CO = 'Presupuesto (todas las variantes)';tr = 'Teklif (tüm varyantlar)';it = 'Preventivo (tutte le varianti)';de = 'Angebot (alle Varianten)'");
	PrintCommand.FormsList					= "DocumentForm,ListForm,DocumentsListForm";
	PrintCommand.CheckPostingBeforePrint	= True;
	PrintCommand.Order						= 2;
	
	PrintCommand = PrintCommands.Add();
	PrintCommand.ID							= "ProformaInvoice";
	PrintCommand.Presentation				= NStr("en = 'Proforma invoice'; ru = 'Проформа-инвойс';pl = 'Faktura proforma';es_ES = 'Factura proforma';es_CO = 'Factura proforma';tr = 'Proforma fatura';it = 'Fattura proforma';de = 'Proforma-Rechnung'");
	PrintCommand.FormsList					= "DocumentForm,ListForm,DocumentsListForm";
	PrintCommand.CheckPostingBeforePrint	= True;
	PrintCommand.Order						= 3;
	
	PrintCommand = PrintCommands.Add();
	PrintCommand.ID							= "ProformaInvoiceAllVariants";
	PrintCommand.Presentation				= NStr("en = 'Proforma invoice (all variants)'; ru = 'Проформа-инвойс (все варианты)';pl = 'Faktura proforma (wszystkie warianty)';es_ES = 'Factura proforma (todas las variantes)';es_CO = 'Factura proforma (todas las variantes)';tr = 'Proforma fatura (tüm varyantlar)';it = 'Fattura proforma (tutte le varianti)';de = 'Proforma-Rechnung (alle Varianten)'");
	PrintCommand.FormsList					= "DocumentForm,ListForm,DocumentsListForm";
	PrintCommand.CheckPostingBeforePrint	= True;
	PrintCommand.Order						= 4;
	
EndProcedure

#Region ObjectVersioning

// StandardSubsystems.ObjectVersioning

Procedure OnDefineObjectVersioningSettings(Settings) Export

EndProcedure

// End StandardSubsystems.ObjectVersioning

#EndRegion

#Region MessageTemplates

// StandardSubsystems.MessageTemplates

// It is called when preparing message templates and allows you to override a list of attributes and attachments.
//
// Parameters:
//  Attributes - ValueTree - a list of template attributes.
//    * Name            - String - a unique name of a common attribute.
//    * Presentation  - String - a common attribute presentation.
//    * Type            - Type - an attribute type. It is a string by default.
//    * Format         - String - a value output format for numbers, dates, strings, and boolean values.
//  Attachments - ValueTable - print forms and attachments, where:
//    * Name           - String - a unique attachment name.
//    * Presentation - String - an option presentation.
//    * FileType      - String - an attachment type that matches the file extension: pdf, png, jpg, mxl, and so on.
//  AdditionalParameters - Structure - additional information on the message template.
//
Procedure OnPrepareMessageTemplate(Attributes, Attachments, AdditionalParameters) Export
	
EndProcedure

// It is called upon creating messages from template to fill in values of attributes and attachments.
//
// Parameters:
//  Message - Structure - a structure with the following keys:
//    * AttributesValues - Map - a list of attributes used in the template.
//      ** Key     - String - an attribute name in the template.
//      ** Value - String - a filling value in the template.
//    * CommonAttributesValues - Map - a list of common attributes used in the template.
//      ** Key     - String - an attribute name in the template.
//      ** Value - String - a filling value in the template.
//    * Attachments - Map - attribute values
//      ** Key     - String - an attachment name in the template.
//      ** Value - BinaryData, String - binary data or an address in a temporary storage of the attachment.
//    * AdditionalParameters - Structure - additional message parameters.
//  MessageSubject - AnyRef - a reference to an object that is a data source.
//  AdditionalParameters - Structure - additional information on the message template.
//
Procedure OnCreateMessage(Message, MessageSubject, AdditionalParameters) Export
	
EndProcedure

// Fills in a list of text message recipients when sending a message generated from template.
//
// Parameters:
//   SMSMessageRecipients - ValueTable - a list of text message recipients.
//     * PhoneNumber - String - a phone number to send a text message to.
//     * Presentation - String - a text message recipient presentation.
//     * Contact       - Arbitrary - a contact that owns the phone number.
//  MessageSubject - AnyRef - a reference to an object that is a data source.
//                   - Structure  - a structure describing template parameters:
//    * Subject               - AnyRef - a reference to an object that is a data source.
//    * ArbitraryParameters - Map - a filled list of arbitrary parameters.
//
Procedure OnFillRecipientsPhonesInMessage(SMSMessageRecipients, MessageSubject) Export
	
EndProcedure

// Fills in a list of email recipients upon sending a message generated from a template.
//
// Parameters:
//   MailRecipients - ValueTable - a list of mail recipients.
//     * Address           - String - a recipient email address.
//     * Presentation   - String - an email recipient presentation.
//     * Contact         - Arbitrary - a contact that owns the email address.
//  MessageSubject - AnyRef - a reference to an object that is a data source.
//                   - Structure  - a structure describing template parameters:
//    * Subject               - AnyRef - a reference to an object that is a data source.
//    * ArbitraryParameters - Map - a filled list of arbitrary parameters.
//
Procedure OnFillRecipientsEmailsInMessage(EmailRecipients, MessageSubject) Export
	
EndProcedure

// End StandardSubsystems.MessageTemplates

#EndRegion

// StandardSubsystems.Interactions

// Get counterparty and contact persons.
//
// Parameters:
//  Subject  - DocumentRef.GoodsIssue - the document whose contacts you need to get.
//
// Returns:
//   Array   - array of contacts.
// 
Function GetContacts(Subject) Export
	
	If Not ValueIsFilled(Subject) Then
		Return New Array;
	EndIf;
	
	Return DriveContactInformationServer.GetContactsRefs(Subject);
	
EndFunction

// End StandardSubsystems.Interactions

#EndRegion

// Initializes the tables of values that contain the data of the document table sections.
// Saves the tables of values in the properties of the structure "AdditionalProperties".
//
Procedure InitializeDocumentData(DocumentRef, StructureAdditionalProperties) Export
	
	Query = New Query;
	
	Query.TempTablesManager = StructureAdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;
	
	Query.SetParameter("Ref", DocumentRef);
	Query.SetParameter("PresentationCurrency", StructureAdditionalProperties.ForPosting.PresentationCurrency);
	Query.SetParameter("ExchangeRateMethod", StructureAdditionalProperties.ForPosting.ExchangeRateMethod);
	
	Query.Text =
	"SELECT
	|	Quote.Ref AS Ref,
	|	Quote.Company AS Company,
	|	Quote.Counterparty AS Counterparty,
	|	&PresentationCurrency AS PresentationCurrency,
	|	CAST(Quote.DocumentAmount * CASE
	|			WHEN &ExchangeRateMethod = VALUE(Enum.ExchangeRateMethods.Multiplier)
	|				THEN Quote.ExchangeRate / Quote.Multiplicity
	|			WHEN &ExchangeRateMethod = VALUE(Enum.ExchangeRateMethods.Divisor)
	|				THEN Quote.Multiplicity / Quote.ExchangeRate
	|		END AS NUMBER(15, 2)) AS Amount,
	|	Quote.Date AS Period
	|INTO TemporaryTableHeader
	|FROM
	|	Document.Quote AS Quote
	|WHERE
	|	Quote.Ref = &Ref";
	
	Query.ExecuteBatch();
	
	// Register record table creation
	GenerateTableQuotations(DocumentRef, StructureAdditionalProperties);
	
EndProcedure

#Region GLAccounts

Function GetGLAccountsStructure(StructureData) Export

	GLAccountsForFilling = New Structure;
	
	Return GLAccountsForFilling;
	
EndFunction

#EndRegion

#EndRegion

#Region EventHandlers

Procedure FormGetProcessing(FormType, Parameters, SelectedForm, AdditionalInformation, StandardProcessing)
	
	User = Users.CurrentUser();
	
	If TypeOf(User) = Type("CatalogRef.ExternalUsers") Then
		If FormType = "ListForm" Then
			StandardProcessing = False;
			SelectedForm = "ListFormForExternalUsers";
		ElsIf FormType = "ChoiceForm" Then
			StandardProcessing = False;
			SelectedForm = "ChoiceFormForExternalUsers";
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

// Generates a table of values that contains the data for the register.
// Saves the tables of values in the properties of the structure "AdditionalProperties".
//
Procedure GenerateTableQuotations(DocumentRef, StructureAdditionalProperties)
	
	Query = New Query;
	Query.TempTablesManager = StructureAdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;
	
	Query.Text =
	"SELECT
	|	TableQuotations.Ref AS Quotation,
	|	TableQuotations.Company AS Company,
	|	TableQuotations.Counterparty AS Counterparty,
	|	TableQuotations.PresentationCurrency AS PresentationCurrency,
	|	TableQuotations.Amount AS Amount,
	|	TableQuotations.Period AS Period
	|FROM
	|	TemporaryTableHeader AS TableQuotations";
	
	QueryResult = Query.Execute();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableQuotations", QueryResult.Unload());
	
EndProcedure

#EndRegion

#Region IncomeAndExpenseItemsInDocuments

Function GetIncomeAndExpenseItemsStructure(StructureData) Export 
	Return New Structure;
EndFunction

Function GetIncomeAndExpenseItemsGLAMap(StructureData) Export

	Result = New Structure;
	If StructureData.TabName = "Inventory" Then
		Result.Insert("RevenueGLAccount", "RevenueItem");
	EndIf;
	
	Return Result;
	
EndFunction

Procedure UpdateQuotationStatus() Export
	
	DefaultLanguageCode = CommonClientServer.DefaultLanguageCode();
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	Quote.Ref AS Ref
	|INTO QuoteTable
	|FROM
	|	Document.Quote AS Quote
	|		LEFT JOIN InformationRegister.QuotationKanbanStatuses.SliceLast AS QuotationKanbanStatuses
	|		ON Quote.Ref = QuotationKanbanStatuses.Quotation
	|WHERE
	|	NOT Quote.DeletionMark
	|	AND ISNULL(QuotationKanbanStatuses.Status, VALUE(Catalog.QuotationStatuses.EmptyRef)) <> VALUE(Catalog.QuotationStatuses.Converted)
	|	AND ISNULL(QuotationKanbanStatuses.Status, VALUE(Catalog.QuotationStatuses.EmptyRef)) <> VALUE(Catalog.QuotationStatuses.Closed)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	QuoteTable.Ref AS Ref
	|INTO QuoteTableWithDocs
	|FROM
	|	Document.SalesInvoice AS SalesInvoice
	|		INNER JOIN QuoteTable AS QuoteTable
	|		ON SalesInvoice.BasisDocument = QuoteTable.Ref
	|WHERE
	|	SalesInvoice.Posted
	|
	|UNION ALL
	|
	|SELECT
	|	QuoteTable.Ref
	|FROM
	|	Document.SalesOrder AS SalesOrder
	|		INNER JOIN QuoteTable AS QuoteTable
	|		ON SalesOrder.BasisDocument = QuoteTable.Ref
	|WHERE
	|	SalesOrder.Posted
	|
	|UNION ALL
	|
	|SELECT
	|	QuoteTable.Ref
	|FROM
	|	Document.WorkOrder AS WorkOrder
	|		INNER JOIN QuoteTable AS QuoteTable
	|		ON WorkOrder.BasisDocument = QuoteTable.Ref
	|WHERE
	|	WorkOrder.Posted
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT DISTINCT
	|	QuoteTableWithDocs.Ref AS Ref
	|FROM
	|	QuoteTableWithDocs AS QuoteTableWithDocs";
	
	Selection = Query.Execute().Select();
	
	While Selection.Next() Do
		
		BeginTransaction();
		
		Try
			
			QuotationStatuses.SetQuotationStatus(Selection.Ref, Catalogs.QuotationStatuses.Converted);
			
			CommitTransaction();
			
		Except
			
			RollbackTransaction();
			
			ErrorDescription = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = 'Cannot update status of document ""%1"". Details: %2'; ru = 'Не удалось обновить статус документа ""%1"". Подробнее: %2';pl = 'Nie można zaktualizować statusu dokumentu ""%1"". Szczegóły: %2';es_ES = 'No se ha podido actualizar el estado del documento ""%1"". Detalles: %2';es_CO = 'No se ha podido actualizar el estado del documento ""%1"". Detalles: %2';tr = '""%1"" belgesinin durumu güncellenemiyor. Ayrıntılar: %2';it = 'Impossibile aggiornare lo stato del documento ""%1"". Dettagli: %2';de = 'Aktualisieren des Status des Dokuments ""%1"" fehlgeschlagen. Details: %2'", DefaultLanguageCode),
				Selection.Ref,
				BriefErrorDescription(ErrorInfo()));
			
			WriteLogEvent(NStr("en = 'Infobase update'; ru = 'Обновление информационной базы';pl = 'Aktualizacja bazy informacyjnej';es_ES = 'Actualización de la infobase';es_CO = 'Actualización de la infobase';tr = 'Infobase güncellemesi';it = 'Aggiornamento infobase';de = 'Infobase-Aktualisierung'", DefaultLanguageCode),
				EventLogLevel.Error,
				Metadata.InformationRegisters.QuotationKanbanStatuses,
				,
				ErrorDescription);
			
		EndTry;
		
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
